ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263P/ECC_AGGR_ECC_AGGR_53010000h.xml
<module name="ECC_AGGR" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="ECC_AGGR_AGGR_REVISION" acronym="ECC_AGGR_AGGR_REVISION" offset="0" width="32" description="The Revision Register contains the major and minor revisions for the ECC aggregator module. It does not support byte accesses.">
		<bitfield id="SCHEME" width="2" begin="31" end="30" resetval="0x1" description="Scheme" range="31:30" rwaccess="R"/>
	<bitfield id="BU" width="2" begin="29" end="28" resetval="0x2" description="Business unit" range="29:28" rwaccess="R"/>
	<bitfield id="MODULE_ID" width="12" begin="27" end="16" resetval="0x1696" description="Module ID" range="27:16" rwaccess="R"/>
	<bitfield id="REVRTL" width="5" begin="15" end="11" resetval="0x24" description="RTL version" range="15:11" rwaccess="R"/>
	<bitfield id="REVMAJ" width="3" begin="10" end="8" resetval="0x2" description="Major version" range="10:8" rwaccess="R"/>
	<bitfield id="CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Custom version" range="7:6" rwaccess="R"/>
	<bitfield id="REVMIN" width="6" begin="5" end="0" resetval="0x0" description="Minor version" range="5:0" rwaccess="R"/>
	</register><register id="ECC_AGGR_ECC_VECTOR" acronym="ECC_AGGR_ECC_VECTOR" offset="8" width="32" description="ECC RAM ID to select which ECC RAM to control or read status from.">
		<bitfield id="RD_SVBUS_DONE" width="1" begin="24" end="24" resetval="0x0" description="Status to indicate if read on serial bus is complete" range="24" rwaccess="R"/>
	<bitfield id="RD_SVBUS_ADDRESS" width="8" begin="23" end="16" resetval="0x0" description="Read address" range="23:16" rwaccess="R/W"/>
	<bitfield id="RD_SVBUS" width="1" begin="15" end="15" resetval="0x0" description="Trigger a read operation to the specified read address that requires a serial bus access. In normal operation, the trigger bit is only '1' for a single cycle and thus can not be read back." range="15" rwaccess="R/W1TS"/>
	<bitfield id="ECC_VECTOR" width="11" begin="10" end="0" resetval="0x0" description="Value written to select the corresponding ECC RAM for control or status" range="10:0" rwaccess="R/W"/>
	</register><register id="ECC_AGGR_MISC_STATUS" acronym="ECC_AGGR_MISC_STATUS" offset="12" width="32" description="Contains misc status such as number of ECC RAMs serviced by the ECC aggregator.">
		<bitfield id="NUM_RAMS" width="11" begin="10" end="0" resetval="0x9" description="Indicates the number of RAMS serviced by the ECC aggregator" range="10:0" rwaccess="R"/>
	</register><register id="ECC_AGGR_ECC_WRAP_REVISION" acronym="ECC_AGGR_ECC_WRAP_REVISION" offset="16" width="32" description="Revision parameters.">
		<bitfield id="SCHEME" width="2" begin="31" end="30" resetval="0x1" description="Scheme" range="31:30" rwaccess="R"/>
	<bitfield id="BU" width="2" begin="29" end="28" resetval="0x2" description="Business unit" range="29:28" rwaccess="R"/>
	<bitfield id="MODULE_ID" width="12" begin="27" end="16" resetval="0x1700" description="Module ID" range="27:16" rwaccess="R"/>
	<bitfield id="REVRTL" width="5" begin="15" end="11" resetval="0x0" description="RTL version" range="15:11" rwaccess="R"/>
	<bitfield id="REVMAJ" width="3" begin="10" end="8" resetval="0x2" description="Major version" range="10:8" rwaccess="R"/>
	<bitfield id="CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Custom version" range="7:6" rwaccess="R"/>
	<bitfield id="REVMIN" width="6" begin="5" end="0" resetval="0x2" description="Minor version" range="5:0" rwaccess="R"/>
	</register><register id="ECC_AGGR_CONTROL" acronym="ECC_AGGR_CONTROL" offset="20" width="32" description="ECC Control Register.">
		<bitfield id="CHECK_SVBUS_TIMEOUT" width="1" begin="8" end="8" resetval="0x1" description="check for svbus timeout errors" range="8" rwaccess="R/W"/>
	<bitfield id="CHECK_PARITY" width="1" begin="7" end="7" resetval="0x1" description="check for parity errors" range="7" rwaccess="R/W"/>
	<bitfield id="ERROR_ONCE" width="1" begin="6" end="6" resetval="0x0" description="Force Error only once" range="6" rwaccess="R/W"/>
	<bitfield id="FORCE_N_ROW" width="1" begin="5" end="5" resetval="0x0" description="Force Error on any RAM read" range="5" rwaccess="R/W"/>
	<bitfield id="FORCE_DED" width="1" begin="4" end="4" resetval="0x0" description="Force Double Bit Error" range="4" rwaccess="R/W"/>
	<bitfield id="FORCE_SEC" width="1" begin="3" end="3" resetval="0x0" description="Force Single Bit Error" range="3" rwaccess="R/W"/>
	<bitfield id="ENABLE_RMW" width="1" begin="2" end="2" resetval="0x1" description="Enable rmw" range="2" rwaccess="R/W"/>
	<bitfield id="ECC_CHECK" width="1" begin="1" end="1" resetval="0x1" description="Enable ECC check" range="1" rwaccess="R/W"/>
	<bitfield id="ECC_ENABLE" width="1" begin="0" end="0" resetval="0x1" description="Enable ECC" range="0" rwaccess="R/W"/>
	</register><register id="ECC_AGGR_ERROR_CTRL1" acronym="ECC_AGGR_ERROR_CTRL1" offset="24" width="32" description="ECC Error Control1 Register.">
		<bitfield id="ECC_ROW" width="32" begin="31" end="0" resetval="0x0" description="Row address where single or double-bit error needs to be applied. This is ignored if force_n_row is set" range="31:0" rwaccess="R/W"/>
	</register><register id="ECC_AGGR_ERROR_CTRL2" acronym="ECC_AGGR_ERROR_CTRL2" offset="28" width="32" description="ECC Error Control2 Register.">
		<bitfield id="ECC_BIT2" width="16" begin="31" end="16" resetval="0x0" description="Data bit that needs to be flipped if double bit error needs to be forced" range="31:16" rwaccess="R/W"/>
	<bitfield id="ECC_BIT1" width="16" begin="15" end="0" resetval="0x0" description="Data bit that needs to be flipped when force_sec is set" range="15:0" rwaccess="R/W"/>
	</register><register id="ECC_AGGR_ERROR_STATUS1" acronym="ECC_AGGR_ERROR_STATUS1" offset="32" width="32" description="ECC Error Status1 Register.">
		<bitfield id="ECC_BIT1" width="16" begin="31" end="16" resetval="0x0" description="Data bit that corresponds to the single-bit error" range="31:16" rwaccess="R"/>
	<bitfield id="CLR_CTRL_REG_ERR" width="1" begin="15" end="15" resetval="0x0" description="Clear control reg error Error Status, you must also re write the control register itself to clear this" range="15" rwaccess="R/W1TC"/>
	<bitfield id="CLR_PARITY_ERR" width="2" begin="14" end="13" resetval="0x0" description="Clear parity Error Status" range="14:13" rwaccess="R/WD"/>
	<bitfield id="CLR_ECC_OTHER" width="1" begin="12" end="12" resetval="0x0" description="Clear other Error Status" range="12" rwaccess="R/W1TC"/>
	<bitfield id="CLR_ECC_DED" width="2" begin="11" end="10" resetval="0x0" description="Clear Double Bit Error Status" range="11:10" rwaccess="R/WD"/>
	<bitfield id="CLR_ECC_SEC" width="2" begin="9" end="8" resetval="0x0" description="Clear Single Bit Error Status" range="9:8" rwaccess="R/WD"/>
	<bitfield id="CTR_REG_ERR" width="1" begin="7" end="7" resetval="0x0" description="control register error pending, Level interrupt" range="7" rwaccess="R/W1TS"/>
	<bitfield id="PARITY_ERR" width="2" begin="6" end="5" resetval="0x0" description="Level parity error Error Status" range="6:5" rwaccess="R/W1TS"/>
	<bitfield id="ECC_OTHER" width="1" begin="4" end="4" resetval="0x0" description="Successive single-bit errors have occurred while a writeback is still pending, Level interrupt" range="4" rwaccess="R/W1TS"/>
	<bitfield id="ECC_DED" width="2" begin="3" end="2" resetval="0x0" description="Level Double Bit Error Status" range="3:2" rwaccess="R/WI"/>
	<bitfield id="ECC_SEC" width="2" begin="1" end="0" resetval="0x0" description="Level Single Bit Error Status" range="1:0" rwaccess="R/WI"/>
	</register><register id="ECC_AGGR_ERROR_STATUS2" acronym="ECC_AGGR_ERROR_STATUS2" offset="36" width="32" description="ECC Error Status2 Register.">
		<bitfield id="ECC_ROW" width="32" begin="31" end="0" resetval="0x0" description="Row address where the single or double-bit error has occurred" range="31:0" rwaccess="R"/>
	</register><register id="ECC_AGGR_ERROR_STATUS3" acronym="ECC_AGGR_ERROR_STATUS3" offset="40" width="32" description="ECC Error Status3 Register.">
		<bitfield id="CLR_SVBUS_TIMEOUT_ERR" width="1" begin="9" end="9" resetval="0x0" description="Clear svbus timeout Error Status" range="9" rwaccess="R/W1TC"/>
	<bitfield id="SVBUS_TIMEOUT_ERR" width="1" begin="1" end="1" resetval="0x0" description="Level svbus timeout error Error Status" range="1" rwaccess="R/W1TS"/>
	<bitfield id="WB_PEND" width="1" begin="0" end="0" resetval="0x0" description="delayed write back pending  Status" range="0" rwaccess="R"/>
	</register><register id="ECC_AGGR_SEC_EOI_REG" acronym="ECC_AGGR_SEC_EOI_REG" offset="60" width="32" description="EOI Register.">
		<bitfield id="EOI_WR" width="1" begin="0" end="0" resetval="0x0" description="Write of 1 to this register indicates that software has acknowledged the pending interrupt and the next interrupt can be sent to the host. The bit is self clearing and will be read as a zero." range="0" rwaccess="R/W1TS"/>
	</register><register id="ECC_AGGR_SEC_STATUS_REG0" acronym="ECC_AGGR_SEC_STATUS_REG0" offset="64" width="32" description="Interrupt Status Register 0">
		<bitfield id="MSS_L2SLV5_PEND" width="1" begin="8" end="8" resetval="0x0" description="Interrupt Pending Status for mss_l2slv5_pend" range="8" rwaccess="R/W1TS"/>
	<bitfield id="MSS_L2SLV4_PEND" width="1" begin="7" end="7" resetval="0x0" description="Interrupt Pending Status for mss_l2slv4_pend" range="7" rwaccess="R/W1TS"/>
	<bitfield id="TPTC_A1_PEND" width="1" begin="6" end="6" resetval="0x0" description="Interrupt Pending Status for tptc_a1_pend" range="6" rwaccess="R/W1TS"/>
	<bitfield id="TPTC_A0_PEND" width="1" begin="5" end="5" resetval="0x0" description="Interrupt Pending Status for tptc_a0_pend" range="5" rwaccess="R/W1TS"/>
	<bitfield id="MSS_MBOX_PEND" width="1" begin="4" end="4" resetval="0x0" description="Interrupt Pending Status for mss_mbox_pend" range="4" rwaccess="R/W1TS"/>
	<bitfield id="MSS_L2SLV3_PEND" width="1" begin="3" end="3" resetval="0x0" description="Interrupt Pending Status for mss_l2slv3_pend" range="3" rwaccess="R/W1TS"/>
	<bitfield id="MSS_L2SLV2_PEND" width="1" begin="2" end="2" resetval="0x0" description="Interrupt Pending Status for mss_l2slv2_pend" range="2" rwaccess="R/W1TS"/>
	<bitfield id="MSS_L2SLV1_PEND" width="1" begin="1" end="1" resetval="0x0" description="Interrupt Pending Status for mss_l2slv1_pend" range="1" rwaccess="R/W1TS"/>
	<bitfield id="MSS_L2SLV0_PEND" width="1" begin="0" end="0" resetval="0x0" description="Interrupt Pending Status for mss_l2slv0_pend" range="0" rwaccess="R/W1TS"/>
	</register><register id="ECC_AGGR_SEC_ENABLE_SET_REG0" acronym="ECC_AGGR_SEC_ENABLE_SET_REG0" offset="128" width="32" description="Interrupt Enable Set Register 0">
		<bitfield id="MSS_L2SLV5_ENABLE_SET" width="1" begin="8" end="8" resetval="0x0" description="Interrupt Enable Set Register for mss_l2slv5_pend" range="8" rwaccess="R/W1TS"/>
	<bitfield id="MSS_L2SLV4_ENABLE_SET" width="1" begin="7" end="7" resetval="0x0" description="Interrupt Enable Set Register for mss_l2slv4_pend" range="7" rwaccess="R/W1TS"/>
	<bitfield id="TPTC_A1_ENABLE_SETT" width="1" begin="6" end="6" resetval="0x0" description="Interrupt Enable Set Register for tptc_a1_pend" range="6" rwaccess="R/W1TS"/>
	<bitfield id="TPTC_A0_ENABLE_SET" width="1" begin="5" end="5" resetval="0x0" description="Interrupt Enable Set Register for tptc_a0_pend" range="5" rwaccess="R/W1TS"/>
	<bitfield id="MSS_MBOX_ENABLE_SET" width="1" begin="4" end="4" resetval="0x0" description="Interrupt Enable Set Register for mss_mbox_pend" range="4" rwaccess="R/W1TS"/>
	<bitfield id="MSS_L2SLV3_ENABLE_SET" width="1" begin="3" end="3" resetval="0x0" description="Interrupt Enable Set Register for mss_l2slv3_pend" range="3" rwaccess="R/W1TS"/>
	<bitfield id="MSS_L2SLV2_ENABLE_SET" width="1" begin="2" end="2" resetval="0x0" description="Interrupt Enable Set Register for mss_l2slv2_pend" range="2" rwaccess="R/W1TS"/>
	<bitfield id="MSS_L2SLV1_ENABLE_SET" width="1" begin="1" end="1" resetval="0x0" description="Interrupt Enable Set Register for mss_l2slv1_pend" range="1" rwaccess="R/W1TS"/>
	<bitfield id="MSS_L2SLV0_ENABLE_SET" width="1" begin="0" end="0" resetval="0x0" description="Interrupt Enable Set Register for mss_l2slv0_pend" range="0" rwaccess="R/W1TS"/>
	</register><register id="ECC_AGGR_SEC_ENABLE_CLR_REG0" acronym="ECC_AGGR_SEC_ENABLE_CLR_REG0" offset="192" width="32" description="Interrupt Enable Clear Register 0">
		<bitfield id="MSS_L2SLV5_ENABLE_CLR" width="1" begin="8" end="8" resetval="0x0" description="Interrupt Enable Clear Register for mss_l2slv5_pend" range="8" rwaccess="R/W1TC"/>
	<bitfield id="MSS_L2SLV4_ENABLE_CLR" width="1" begin="7" end="7" resetval="0x0" description="Interrupt Enable Clear Register for mss_l2slv4_pend" range="7" rwaccess="R/W1TC"/>
	<bitfield id="TPTC_A1_ENABLE_CLR" width="1" begin="6" end="6" resetval="0x0" description="Interrupt Enable Clear Register for tptc_a1_pend" range="6" rwaccess="R/W1TC"/>
	<bitfield id="TPTC_A0_ENABLE_CLR" width="1" begin="5" end="5" resetval="0x0" description="Interrupt Enable Clear Register for tptc_a0_pend" range="5" rwaccess="R/W1TC"/>
	<bitfield id="MSS_MBOX_ENABLE_CLR" width="1" begin="4" end="4" resetval="0x0" description="Interrupt Enable Clear Register for mss_mbox_pend" range="4" rwaccess="R/W1TC"/>
	<bitfield id="MSS_L2SLV3_ENABLE_CLR" width="1" begin="3" end="3" resetval="0x0" description="Interrupt Enable Clear Register for mss_l2slv3_pend" range="3" rwaccess="R/W1TC"/>
	<bitfield id="MSS_L2SLV2_ENABLE_CLR" width="1" begin="2" end="2" resetval="0x0" description="Interrupt Enable Clear Register for mss_l2slv2_pend" range="2" rwaccess="R/W1TC"/>
	<bitfield id="MSS_L2SLV1_ENABLE_CLR" width="1" begin="1" end="1" resetval="0x0" description="Interrupt Enable Clear Register for mss_l2slv1_pend" range="1" rwaccess="R/W1TC"/>
	<bitfield id="MSS_L2SLV0_ENABLE_CLR" width="1" begin="0" end="0" resetval="0x0" description="Interrupt Enable Clear Register for mss_l2slv0_pend" range="0" rwaccess="R/W1TC"/>
	</register><register id="ECC_AGGR_DED_EOI_REG" acronym="ECC_AGGR_DED_EOI_REG" offset="316" width="32" description="EOI Register.">
		<bitfield id="EOI_WR" width="1" begin="0" end="0" resetval="0x0" description="Write of 1 to this register indicates that software has acknowledged the pending interrupt and the next interrupt can be sent to the host. The bit is self clearing and will be read as a zero." range="0" rwaccess="R/W1TS"/>
	</register><register id="ECC_AGGR_DED_STATUS_REG0" acronym="ECC_AGGR_DED_STATUS_REG0" offset="320" width="32" description="Interrupt Status Register 0">
		<bitfield id="MSS_L2SLV5_PEND" width="1" begin="8" end="8" resetval="0x0" description="Interrupt Pending Status for mss_l2slv5_pend" range="8" rwaccess="R/W1TS"/>
	<bitfield id="MSS_L2SLV4_PEND" width="1" begin="7" end="7" resetval="0x0" description="Interrupt Pending Status for mss_l2slv4_pend" range="7" rwaccess="R/W1TS"/>
	<bitfield id="TPTC_A1_PEND" width="1" begin="6" end="6" resetval="0x0" description="Interrupt Pending Status for tptc_a1_pend" range="6" rwaccess="R/W1TS"/>
	<bitfield id="TPTC_A0_PEND" width="1" begin="5" end="5" resetval="0x0" description="Interrupt Pending Status for tptc_a0_pend" range="5" rwaccess="R/W1TS"/>
	<bitfield id="MSS_MBOX_PEND" width="1" begin="4" end="4" resetval="0x0" description="Interrupt Pending Status for mss_mbox_pend" range="4" rwaccess="R/W1TS"/>
	<bitfield id="MSS_L2SLV3_PEND" width="1" begin="3" end="3" resetval="0x0" description="Interrupt Pending Status for mss_l2slv3_pend" range="3" rwaccess="R/W1TS"/>
	<bitfield id="MSS_L2SLV2_PEND" width="1" begin="2" end="2" resetval="0x0" description="Interrupt Pending Status for mss_l2slv2_pend" range="2" rwaccess="R/W1TS"/>
	<bitfield id="MSS_L2SLV1_PEND" width="1" begin="1" end="1" resetval="0x0" description="Interrupt Pending Status for mss_l2slv1_pend" range="1" rwaccess="R/W1TS"/>
	<bitfield id="MSS_L2SLV0_PEND" width="1" begin="0" end="0" resetval="0x0" description="Interrupt Pending Status for mss_l2slv0_pend" range="0" rwaccess="R/W1TS"/>
	</register><register id="ECC_AGGR_DED_ENABLE_SET_REG0" acronym="ECC_AGGR_DED_ENABLE_SET_REG0" offset="384" width="32" description="Interrupt Enable Set Register 0">
		<bitfield id="MSS_L2SLV5_ENABLE_SET" width="1" begin="8" end="8" resetval="0x0" description="Interrupt Enable Set Register for mss_l2slv5_pend" range="8" rwaccess="R/W1TS"/>
	<bitfield id="MSS_L2SLV4_ENABLE_SET" width="1" begin="7" end="7" resetval="0x0" description="Interrupt Enable Set Register for mss_l2slv4_pend" range="7" rwaccess="R/W1TS"/>
	<bitfield id="TPTC_A1_ENABLE_SETT" width="1" begin="6" end="6" resetval="0x0" description="Interrupt Enable Set Register for tptc_a1_pend" range="6" rwaccess="R/W1TS"/>
	<bitfield id="TPTC_A0_ENABLE_SET" width="1" begin="5" end="5" resetval="0x0" description="Interrupt Enable Set Register for tptc_a0_pend" range="5" rwaccess="R/W1TS"/>
	<bitfield id="MSS_MBOX_ENABLE_SET" width="1" begin="4" end="4" resetval="0x0" description="Interrupt Enable Set Register for mss_mbox_pend" range="4" rwaccess="R/W1TS"/>
	<bitfield id="MSS_L2SLV3_ENABLE_SET" width="1" begin="3" end="3" resetval="0x0" description="Interrupt Enable Set Register for mss_l2slv3_pend" range="3" rwaccess="R/W1TS"/>
	<bitfield id="MSS_L2SLV2_ENABLE_SET" width="1" begin="2" end="2" resetval="0x0" description="Interrupt Enable Set Register for mss_l2slv2_pend" range="2" rwaccess="R/W1TS"/>
	<bitfield id="MSS_L2SLV1_ENABLE_SET" width="1" begin="1" end="1" resetval="0x0" description="Interrupt Enable Set Register for mss_l2slv1_pend" range="1" rwaccess="R/W1TS"/>
	<bitfield id="MSS_L2SLV0_ENABLE_SET" width="1" begin="0" end="0" resetval="0x0" description="Interrupt Enable Set Register for mss_l2slv0_pend" range="0" rwaccess="R/W1TS"/>
	</register><register id="ECC_AGGR_DED_ENABLE_CLR_REG0" acronym="ECC_AGGR_DED_ENABLE_CLR_REG0" offset="448" width="32" description="Interrupt Enable Clear Register 0">
		<bitfield id="MSS_L2SLV5_ENABLE_CLR" width="1" begin="8" end="8" resetval="0x0" description="Interrupt Enable Clear Register for mss_l2slv5_pend" range="8" rwaccess="R/W1TC"/>
	<bitfield id="MSS_L2SLV4_ENABLE_CLR" width="1" begin="7" end="7" resetval="0x0" description="Interrupt Enable Clear Register for mss_l2slv4_pend" range="7" rwaccess="R/W1TC"/>
	<bitfield id="TPTC_A1_ENABLE_CLR" width="1" begin="6" end="6" resetval="0x0" description="Interrupt Enable Clear Register for tptc_a1_pend" range="6" rwaccess="R/W1TC"/>
	<bitfield id="TPTC_A0_ENABLE_CLR" width="1" begin="5" end="5" resetval="0x0" description="Interrupt Enable Clear Register for tptc_a0_pend" range="5" rwaccess="R/W1TC"/>
	<bitfield id="MSS_MBOX_ENABLE_CLR" width="1" begin="4" end="4" resetval="0x0" description="Interrupt Enable Clear Register for mss_mbox_pend" range="4" rwaccess="R/W1TC"/>
	<bitfield id="MSS_L2SLV3_ENABLE_CLR" width="1" begin="3" end="3" resetval="0x0" description="Interrupt Enable Clear Register for mss_l2slv3_pend" range="3" rwaccess="R/W1TC"/>
	<bitfield id="MSS_L2SLV2_ENABLE_CLR" width="1" begin="2" end="2" resetval="0x0" description="Interrupt Enable Clear Register for mss_l2slv2_pend" range="2" rwaccess="R/W1TC"/>
	<bitfield id="MSS_L2SLV1_ENABLE_CLR" width="1" begin="1" end="1" resetval="0x0" description="Interrupt Enable Clear Register for mss_l2slv1_pend" range="1" rwaccess="R/W1TC"/>
	<bitfield id="MSS_L2SLV0_ENABLE_CLR" width="1" begin="0" end="0" resetval="0x0" description="Interrupt Enable Clear Register for mss_l2slv0_pend" range="0" rwaccess="R/W1TC"/>
	</register><register id="ECC_AGGR_AGGR_ENABLE_SET" acronym="ECC_AGGR_AGGR_ENABLE_SET" offset="512" width="32" description="Enable set register for aggregator interrupts.">
		<bitfield id="TIMEOUT" width="1" begin="1" end="1" resetval="0x0" description="Interrupt enable set for svbus timeout errors" range="1" rwaccess="R/W1TS"/>
	<bitfield id="PARITY" width="1" begin="0" end="0" resetval="0x0" description="Interrupt enable set for parity errors" range="0" rwaccess="R/W1TS"/>
	</register><register id="ECC_AGGR_AGGR_ENABLE_CLR" acronym="ECC_AGGR_AGGR_ENABLE_CLR" offset="516" width="32" description="Enable clear register for aggregator interrupts.">
		<bitfield id="TIMEOUT" width="1" begin="1" end="1" resetval="0x0" description="Interrupt enable clear for svbus timeout errors" range="1" rwaccess="R/W1TC"/>
	<bitfield id="PARITY" width="1" begin="0" end="0" resetval="0x0" description="Interrupt enable clear for parity errors" range="0" rwaccess="R/W1TC"/>
	</register><register id="ECC_AGGR_AGGR_STATUS_SET" acronym="ECC_AGGR_AGGR_STATUS_SET" offset="520" width="32" description="Status set register for aggregator interrupts.">
		<bitfield id="TIMEOUT" width="2" begin="3" end="2" resetval="0x0" description="2-bit saturating counter of the number of timeout errors that have occurred since last cleared. 2'b00 - No timeout errors have occurred 2'b01 - 1 timeout error has occurred 2'b10 - 2 timeout error has occurred 2'b11 - 3 or more timeout errors have occurred A write of a non-zero value to this register increments that many from the timeout fields.  If the value written is less than the current value of the counter, then the pending level interrupt stays asserted. . If this register goes from 0 ot non zero a level interrupt will be asserted as well as a pulse interrupt. If the value was non zero to non zero then the level interrupt would remain asserted, but no new pulse interrupt would be asserted. You must write the eoi register to get a new pulse interrupt." range="3:2" rwaccess="R/WI"/>
	<bitfield id="PARITY" width="2" begin="1" end="0" resetval="0x0" description="2-bit saturating counter of the number of parity errors that have occurred since last cleared. 2'b00 - No parity errors have occurred 2'b01 - 1 parity error has occurred 2'b10 - 2 parity error has occurred 2'b11 - 3 or more parity error have occurred A write of a non-zero value to this register incrments that many from the parity fields.  If the value written is less than the current value of the counter, then the pending level interrupt stays asserted. If this register goes from 0 ot non zero a level interrupt will be asserted as well as a pulse interrupt. If the value was non zero to non zero then the level interrupt would remain asserted, but no new pulse interrupt would be asserted. You must write the eoi register to get a new pulse interrupt." range="1:0" rwaccess="R/WI"/>
	</register><register id="ECC_AGGR_AGGR_STATUS_CLR" acronym="ECC_AGGR_AGGR_STATUS_CLR" offset="524" width="32" description="Status clear register for aggregator interrupts.">
		<bitfield id="TIMEOUT" width="2" begin="3" end="2" resetval="0x0" description="2'b00 - No timeout errors have occurred 2'b01 - 1 timeout error has occurred 2'b10 - 2 timeout error has occurred 2'b11 - 3 or more timeout errors have occurred A write of a non-zero value to this register decrements that many from the timeout fields.  If the resulting written value is non zero, then the pending level interrupt stays asserted. A new pulse interrupt will nto be asserted, you must write the eoi register for that to occur. If you write a value more than the counter value the result will be zero." range="3:2" rwaccess="R/WD"/>
	<bitfield id="PARITY" width="2" begin="1" end="0" resetval="0x0" description="2'b00 - No parity errors have occurred 2'b01 - 1 parity error has occurred 2'b10 - 2 parity error has occurred 2'b11 - 3 or more parity error have occurred A write of a non-zero value to this register decrements that many from the parity fields.  If the resulting written value is non zero, then the pending level interrupt stays asserted. A new pulse interrupt will nto be asserted, you must write the eoi register for that to occur. If you write a value more than the counter value the result will be zero." range="1:0" rwaccess="R/WD"/>
	</register>
</module>